DataProcessors/Renault_АРМ_ContactCenter.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_АРМ_ContactCenter</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ТрафикПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТрафикПоСотрудникам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотрен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отвечен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПросмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ТрафикПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТрафикПисьма</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрафикПросмотрен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КонтактЦентр_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПросмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_РезультатОбработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФорматТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматТекста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_АРМ_ContactCenter/Ext/ObjectModule.bsl
Функция ПолучитьРабочийЛистПоТрафику(ИдентификаторТрафика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Renault_РабочиеЛисты.Ссылка
	|ИЗ
	|	Документ.Renault_РабочийЛист КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.IDТрафика = &IDТрафика";
	Запрос.УстановитьПараметр("IDТрафика", ИдентификаторТрафика);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.Ссылка;
	 Иначе
		 Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ТрафикЛМТПочтаОтвеченный(Ид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ТрафикПоСотрудникам.Отвечен
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика = &id
	|	И Renault_ТрафикПоСотрудникам.Отвечен = ИСТИНА";
	Запрос.УстановитьПараметр("id", Ид);
	//Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Табл = Запрос.Выполнить().Выгрузить();
	Если Табл.Количество()>0 Тогда
		Возврат Истина;//Табл[0].Отвечен;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ЗакрытьТрафик(ИдТрафика, ПричинаЗакрытия = Неопределено, ТипТрафика = Неопределено) Экспорт
	
	Если ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_Лид.Ссылка
		|ИЗ
		|	Документ.Renault_Лид КАК Renault_Лид
		|ГДЕ
		|	Renault_Лид.ТрафикИД = &Идентификатор
		|	И Renault_Лид.Проведен = ИСТИНА";
		Запрос.УстановитьПараметр("Идентификатор", ИдТрафика);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Попытка
				ДокСсылка = Выборка.Ссылка.ПолучитьОбъект();
				ДокСсылка.ТрафикОбработан = Истина;
				ДокСсылка.РезультатОбработки = ПричинаЗакрытия;
				ДокСсылка.Записать();
				Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдТрафика);
				//Запись.Обработан = Истина;
				Запись.Закрытый = Истина;
				Запись.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант Тогда
		Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдТрафика);
		//Запись.Обработан = Истина;
		Если ЗначениеЗаполнено(ПричинаЗакрытия) Тогда
			Запись.Комментарий = Строка(ПричинаЗакрытия.Наименование);
		КонецЕсли;
		Запись.Закрытый = Истина;
		Запись.Записать();
		
		Renault_ОнлайнКонсультант.ЗакрытьСоединениеСКлиентом();
		
	ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
		Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдТрафика);
		//Запись.Обработан = Истина;
		Запись.Закрытый = Истина;
		Запись.Записать();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
		|ГДЕ
		|	Renault_ТрафикПисьма.ИдТрафика = &ID";
		Запрос.УстановитьПараметр("ID", ИдТрафика);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.Renault_ТрафикПисьма.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.РезультатОбработки = ПричинаЗакрытия;
			Запись.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтметитьТрафикЛМТПочтаОтвеченным(Ид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|ГДЕ
	|	Renault_Трафик.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Ид);
	Табл = Запрос.Выполнить().Выгрузить();
	Для Каждого Описание Из Табл Цикл
		Менеджер = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Описание);
		Менеджер.Прочитать();
		Если Менеджер.Выбран() тогда
			ЗаполнитьЗначенияСвойств(Менеджер, Описание);
			Менеджер.Комментарий = Менеджер.Комментарий + Символы.ПС + "Ответ от " + Формат(ТекущаяДата(), "ДФ=""дд.ММ.гггг ЧЧ:мм:сс""");
				Если НЕ ЗначениеЗаполнено(Менеджер.Администратор) Тогда
					Менеджер.Администратор = ПараметрыСеанса.Пользователь.Сотрудник;
				КонецЕсли;
			Менеджер.Обработан = Истина;
			Менеджер.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика = &id
	|	И Renault_ТрафикПоСотрудникам.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("id", Ид);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Табл = Запрос.Выполнить().Выгрузить();
	Запись = РегистрыСведений.Renault_ТрафикПоСотрудникам.СоздатьМенеджерЗаписи();
	Если Табл.Количество() > 0 Тогда
		Описание = Табл[0];
		ЗаполнитьЗначенияСвойств(Запись, Описание);
		Запись.Прочитать();
	Иначе
		Запись.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
		Запись.ИдТрафика = ид;
	КонецЕсли;
	Запись.Отвечен = Истина;
	Запись.Записать();
	
КонецПроцедуры
